EH_OpenFOAM/tests/RushtonReact/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue phis 0.0
    volScalarFieldValue phifs 0.0
);

regions
(
    boxToCell
    {
        box (-0.05 -0.05 0.0) (0.05 0.05 0.045);
        fieldValues
        (
            volScalarFieldValue phis 0.068
            volScalarFieldValue phifs 0.028
        );
    }
);


// ************************************************************************* //
